Documents/РазмещениеКнигПоПолкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РазмещениеКнигПоПолкам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОсвтаткиКнигНаПолках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьКниг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Книга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Книги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стелаж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Стелажи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Полка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РазмещениеКнигПоПолкам/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПереченьКнигПолкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Стелаж = Элементы.ПереченьКниг.ТекущиеДанные.Стелаж;
	
	СписокПолок = ПолучитьСписокПолокССервера(Стелаж);
	Элемент.СписокВыбора.Очистить(); 
	Для Каждого Полка Из СписокПолок Цикл 
		Элемент.СписокВыбора.Добавить(Полка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПолокССервера(Стелаж)
	  Возврат ОбщегоНазначенияСервер.ПолучитьСписокПолок(Стелаж);
КонецФункции
